runWaterCooler/1/fluid/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 273;
    }
    /*interfaceIn
    {
        type            compressible::turbulentTemperatureCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }*/
    interfaceIn
    {
        type            mapped;
        value           uniform 300;
        interpolationScheme cell;
        setAverage          false;
        average             300;
    }
    fixedWalls
    {
        type            fixedGradient;
        gradient           uniform 20000;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
